// 硬编码线路颜色（与原有 广州地铁线路各站.js 中的颜色一致）
const HARDCODED_COLORS = {
    "APM": "#00b5e6",
    "1号线": "#f3d03e",
    "2号线": "#00629b",
    "3号线": "#eca154",
    "3号线北": "#eca154",
    "4号线": "#00843d",
    "5号线": "#c5003e",
    "6号线": "#80225f",
    "7号线": "#87d300",
    "8号线": "#008193",
    "9号线": "#5ec998",
    "10号线": "#7389b2",
    "11号线": "#ffb00a",
    "12号线西": "#435428",
    "12号线东": "#435428",
    "13号线": "#8e8c13",
    "14号线": "#792720",
    "14号线(知识城)": "#792720",
    "18号线": "#0050b4",
    "21号线": "#201747",
    "22号线": "#cf5125",
    "广佛线": "#c4d600",
    "佛山2号线": "#ea2628",
    "佛山3号线": "#002f87",
    "佛山3号线北": "#002f87",

    "海珠有轨1号线": "#6bb23c",
    "黄埔有轨1号线": "#ad2c26",
    "黄埔有轨2号线": "#d9017a",
    "南海有轨1号线": "#60b4e3",
};

const RETRY_TIMES = 3;
const CACHE_KEY = 'gz_metro_cache';